# 영화타이틀 실습 과제

1. 데이터 읽어서 데이터 프레임(titles) 만들기
    - 구글드라이브, 210310/ titles.csv
2. 데이터 확인
    - 필수 명령 7가지?
    - 총 몇건인지, 컬럼은 어떻게 구성되어 있는지, head, tail, 결측치가 있는지
3. 전체 영화는 몇개?
4. 가장 빠른 시기에 제작된 영화 2개는?
5. 제목이 "Hamlet"인 영화는 몇개? 어떤 영화?
6. 제목이 "Tresure Island"는 몇개? 어떤 영화?
    - 제작년도 오름차순으로 나열
7. 1950년에서 1959년 사이에 만들어진 영화는 몇개? 어떤 영화?

In [1]:
import pandas as pd

### 1. 데이터프레임 만들기

In [2]:
titles = pd.read_csv('c:/Users/USER/파이썬공부/titles.csv')
titles

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

### 2. 필수 명령 7가지
- pd.read_csv()
- pd.head()
- pd.tail()
- pd.info()
- pd.isnull().sum()
- pd.describe()
- pd.value_counts()

In [3]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [4]:
titles.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [5]:
titles.head(3)

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969

In [6]:
titles.tail(3)

               title  year
215978         E yue  2005
215979  Lakota Girls  2015
215980  The Sting II  1983

In [7]:
titles.isnull().sum() #결측치는 없음.

title    0
year     0
dtype: int64

In [8]:
titles.value_counts()

title             year
오전 9:04           2007    1
Hellfire          1949    1
Hello Brother     1999    1
                  1994    1
Hello Babies      2014    1
                         ..
Relax             2005    1
Relatos salvajes  2014    1
Relatos           2009    1
Relativity        2016    1
#1 Mamarazzi      2015    1
Length: 215981, dtype: int64

### 3. 전체 영화 개수

In [9]:
title_count = titles['title'].count()
print ('전체 영화는',title_count,'개')

전체 영화는 215981 개

In [10]:
#실습리뷰 추가 정답
titles.shape[0]
#컬럼 개수는 titles.shape[1]

215981

In [11]:
len(titles)

215981

In [12]:
#DataFrame을 반복해서 행을 처리하고 싶을 때
#for i in range(0,len(titles)):
 #   print('data =', i)

### 4. 가장 빠른 시기에 제작된 영화 2개

In [13]:
titles_sorted = titles.sort_values(by='year')
titles_sorted.head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

### 5. 제목이 "Hamlet"인 영화는 몇개? 어떤 영화?

In [14]:
Hamlet = titles[titles['title'] =='Hamlet']
Hamlet

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [15]:
print('제목이 "Hamlet"인 영화는', Hamlet['title'].count(),'개')

제목이 "Hamlet"인 영화는 19 개

### 6. 제목이 "Tresure Island"는 몇개? 어떤 영화? (제작년도 오름차순으로 나열)

In [16]:
TI = titles[titles['title'] =='Treasure Island']
print('제목이 "Treasure Island"인 영화는', TI['title'].count(),'개')

TI_sorted = TI.sort_values(by='year')
TI_sorted

제목이 "Treasure Island"인 영화는 8 개

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

### 7. 1950년에서 1959년 사이에 만들어진 영화는 몇개? 어떤 영화?

In [17]:
titles_old = titles[(titles['year']>=1950)&(titles['year']<=1959)]
titles_old

                                         title  year
9                               Women's Prison  1955
37      La momia azteca contra el robot humano  1958
86                            Botta e risposta  1950
88                         Perdeu-se um Marido  1957
106                             Qiu yu can hua  1953
...                                        ...   ...
215856                    Tischlein, deck dich  1956
215890                        Some Like It Hot  1959
215915                             Black Widow  1951
215919                             Encrucijada  1956
215945                       Te sigo esperando  1952

[12120 rows x 2 columns]

In [18]:
print('1950년에서 1959년 사이에 만들어진 영화는', titles_old['title'].count(),'개')

1950년에서 1959년 사이에 만들어진 영화는 12120 개